# Урок 5. Ускоренная обработка данных: lambda, filter, map, zip, enumerate, list comprehension

# 1. НОД двух чисел







# 2. Объявите анонимную (лямбда) функцию для определения вхождения в переданную ей строку 
# фрагмента "plr". То есть, функция должна возвращать True, если такой фрагмент 
# присутствует в строке и False - в противном случае.



# # 3. В файле находится N натуральных чисел, записанных через пробел. 
# # Среди чисел не хватает одного, чтобы выполнялось условие A[i] - 1 = A[i-1]. 
# # Найдите это число.

# 1.
# with open('text_5_3.txt', 'r') as n:
#     lst = [int(i) for i in n.readline().split()]
#     for i in range(1, len(lst)):
#         if lst[i] - lst[i - 1] > 1:
#             print(lst[i] - 1)

# 2.



# 4. Напишите программу, удаляющую из текста все слова, содержащие "абв".











